package bdtube.vumobile.com.bdtube;

import android.app.Dialog;
import android.content.Context;
import android.graphics.PorterDuff;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.Toolbar;
import android.view.View;
import android.view.Window;
import android.widget.TextView;

public class FaqActivity extends AppCompatActivity {

    private Toolbar toolbar;
    private TextView txtFaq;
    public static String operator_type = "";

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_faq);
        toolbar = (Toolbar) findViewById(R.id.toolbar);

        setSupportActionBar(toolbar);
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        getSupportActionBar().setDisplayShowHomeEnabled(true);
        getSupportActionBar().setIcon(R.drawable.jgj);
        getSupportActionBar().setTitle("");
        toolbar.getNavigationIcon().setColorFilter(getResources().getColor(R.color.white), PorterDuff.Mode.SRC_ATOP);
        toolbar.setNavigationOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                onBackPressed(); // Implemented by activity
            }
        });

        FUCK(this,operator_type);
    }

    public void FUCK(final Context context, String operatorType) {

        final Dialog dialog = new Dialog(context);
        dialog.requestWindowFeature(Window.FEATURE_NO_TITLE);

        dialog.setContentView(R.layout.dialog_faq);
        txtFaq = (TextView) findViewById(R.id.txtFaq);

        // 1 is for ROBI
        if (operatorType.equals("1")) {
            txtFaq.setText("BDTUBE একটি ওয়াপ এবং App ভিত্তিক সেবা যার মাধ্যমে গ্রাহক বাংলা চলচ্চিত্র, স্বল্পদৈর্ঘ্য চলচ্চিত্র, মুভি ক্লিপ্স, মিউজিক, ফান ভিডিও, নাটক, টেলিফিল্ম, ভিডিও গানের স্ট্রিমিং দেখতে পারবেন। সাবস্ক্রিপশনের ভিত্তিতে এই সেবা পাওয়া যাবে। \n" +
                    "● সাবস্ক্রিপশনের ভিত্তিতে গ্রাহক দৈনিক সকল কনটেন্ট  ফ্রি দেখতে পারবেন। \n" +
                    "● সাবস্ক্রিপশন ফি হবে দৈনিক ২ টাকা (+ভ্যাট+এসডি+এসসি)। \n" +
                    "● BDTUBE এ নিবন্ধন করার পরে গ্রাহককে তার ড্যাটা সংযোগ সক্রিয় রাখতে হবে, যাতে তার কাঙ্খিত কনটেন্ট দেখতে পারেন। \n" +
                    "\n" +
                    "কিভাবে সেবাটি চালু করবেন: \n" +
                    "● APP : যে কোনো কনটেন্ট এ ক্লিক করুন, এবং নিবন্ধন বাটনটি ক্লিক করুন। \n" +
                    "\n" +
                    "কিভাবে সেবাটি বন্ধ করবেন: \n" +
                    "●এসএমএস: STOP লিখে 2128304 নম্বরে পাঠিয়ে দিন\n" +
                    " \n" +
                    "\n" +
                    "সংযোগের জন্যে কিছু নির্দেশনা দেওয়া হলো: \n" +
                    "●আপনার মোবাইলে রবি ইন্টারনেট (ওয়াপ/ইন্টারনেট) সেটআপ থাকতে হবে।\n" +
                    "●রবি প্রিপেইড/পোস্টপেইড সংযোগের ক্ষেত্রে আপনার এ্যাকাউন্টে যথেষ্ট পরিমাণ ক্রেডিট থাকতে হবে। \n" +
                    "দ্রষ্টব্য:  ভিডিও স্ট্রিমিং এর জন্য ড্যাটা চার্জ প্রযোজ্য হবে | \n" +
                    "\n" +
                    "গ্রাহক সেবা:\n" +
                    "কাস্টমার কেয়ার: 8801814426426 সকাল ৮ টা থেকে সন্ধ্যা ৭ টা পর্যন্ত)।\n" +
                    "●ইমেইল : support@vumobile.biz\n");
            // 2 is for BL
        } else if (operatorType.equals("2")) {
            txtFaq.setText("BDTUBE\n" +
                    "BDTUBE একটি ওয়াপ এবং App  ভিত্তিক সেবা যেখান থেকে গ্রাহক বাংলা চলচ্চিত্র, স্বল্পদৈর্ঘ্য চলচ্চিত্র,মুভি ক্লিপ্স, মিউজিক, ফান ভিডি, নাটক, টেলিফিল্ম, ভিডিও গানের স্ট্রিমিং দেখতে পারবেন । সাবস্ক্রিপশনের ভিত্তিতে অনুযায়ী এই সেবা পাওয়া যাবে। \n" +
                    "● সাবস্ক্রিপশনের ভিত্তিতে গ্রাহক দৈনিক ৫টি কনটেন্ট ফ্রি দেখতে পারবেন । \n" +
                    "● সাবস্ক্রিপশন ফি হবে দৈনিক ২ টাকা (+ ভ্যাট+এসডি ও এস সি )। \n" +
                    "● BDTUBE এ নিবন্ধন করার পরে গ্রাহককে তার ড্যাটা সংযোগ সক্রিয় রাখতে হবে, যাতে তার কাঙ্খিত কনটেন্ট দেখতে পারেন। \n" +
                    "● দৈনিক ৫টি ফ্রি কনটেন্ট দেখার পর গ্রাহক আবার ২ টাকা (+ ভ্যাট+এসডি ও এস সি )চার্জ্ দিয়ে অতিরিক্ত ৫টি কনটেন্ট দেখতে পারবেন | \n" +
                    "● ফুল মুভির জন্যে ২০ টাকা (+এসডি + ভ্যাট + সারচার্জ )/ কনটেন্ট । \n" +
                    "\n" +
                    "কিভাবে সেবাটি চালু করবেন: \n" +
                    "● এসএমএস: START BDTUBE লিখে 6624 নম্বরে পাঠান। \n" +
                    "●App: যে কোনো কনটেন্ট এ ক্লিক করুন, এবং যোগ দিন বাটনটি ক্লিক করুন। \n" +
                    "\n" +
                    "কিভাবে সেবাটি বন্ধ করবেন: \n" +
                    "●এসএমএস: STOP BDTUBE লিখে 6624 নম্বরে পাঠিয়ে দিন।\n" +
                    "\n" +
                    "সংযোগের জন্যে কিছু নির্দেশনা দেওয়া হলো: \n" +
                    "●আপনার মোবাইলে বাংলালিংক ইন্টারনেট (ওয়াপ/ইন্টারনেট) সেটআপ থাকতে হবে।\n" +
                    "●বাংলালিংক প্রিপেইড/পোস্টপেইড সংযোগের ক্ষেত্রে আপনার এ্যাকাউন্টে যথেষ্ট পরিমাণ ক্রেডিট থাকতে হবে। \n" +
                    "\n" +
                    "দ্রষ্টব্য: ভিডিও স্ট্রিমিং এর জন্য ড্যাটা চার্জ প্রযোজ্য হবে | \n" +
                    "\n" +
                    "গ্রাহক সেবা:\n" +
                    "কাস্টমার কেয়ার: 8801992303765 সকাল ৮ টা থেকে সন্ধ্যা ৭ টা পর্যন্ত)।\n" +
                    "●ইমেইল : support@vumobile.biz\n");
            // 3 is for TT
        } else if (operatorType.equals("3")) {
            txtFaq.setText("BDTUBE\n" +
                    "BDTUBE একটি ওয়াপ এবং App  ভিত্তিক সেবা  যেখান  থেকে গ্রাহক বাংলা চলচ্চিত্র, স্বল্পদৈর্ঘ্য চলচ্চিত্র,মুভি ক্লিপ্স, মিউজিক,  ফানি ভিডি, নাটক, টেলিফিল্ম, ভিডিও গানের স্ট্রিমিং দেখতে পারবেন । সাবস্ক্রিপশনের ভিত্তিতে অনুযায়ী এই সেবা পাওয়া যাবে। \n" +
                    "● সাবস্ক্রিপশনের ভিত্তিতে গ্রাহক দৈনিক ৫টি কনটেন্ট ফ্রি দেখতে পারবেন । \n" +
                    "● সাবস্ক্রিপশন ফি হবে  দৈনিক ২ টাকা (+ ভ্যাট+এসডি ও এস সি )। \n" +
                    "● BDTUBE এ নিবন্ধন করার পরে গ্রাহককে তার ড্যাটা সংযোগ সক্রিয় রাখতে হবে, যাতে তার কাঙ্খিত কনটেন্ট দেখতে পারেন। \n" +
                    "● দৈনিক ৫টি ফ্রি কনটেন্ট দেখার পর গ্রাহক আবার ২ টাকা (+ ভ্যাট+এসডি ও এস সি )চার্জ্ দিয়ে অতিরিক্ত ৫টি কনটেন্ট দেখতে পারবেন | \n" +
                    "● মুভি ভিডিও’র জন্যে ১০ টাকা (+এসডি + ভ্যাট + সারচার্জ )। \n" +
                    "\n" +
                    "কিভাবে সেবাটি চালু করবেন: \n" +
                    "● এসএমএস:  START BDTUBE লিখে 6624 নম্বরে পাঠান। \n" +
                    "● App:  যে কোনো কনটেন্ট এ ক্লিক করুন , এবং যোগ দিন বাটনটি ক্লিক করুন। \n" +
                    "\n" +
                    "কিভাবে সেবাটি বন্ধ করবেন: \n" +
                    "●এসএমএস: STOP BDTUBE লিখে 6624 নম্বরে পাঠিয়ে দিন।\n" +
                    "\n" +
                    "সংযোগের জন্যে কিছু নির্দেশনা দেওয়া হলো: \n" +
                    "●আপনার মোবাইলে টেলিটক ইন্টারনেট (ওয়াপ/ইন্টারনেট) সেটআপ থাকতে হবে।\n" +
                    "●টেলিটক প্রিপেইড/পোস্টপেইড সংযোগের ক্ষেত্রে আপনার এ্যাকাউন্টে যথেষ্ট পরিমাণ ক্রেডিট থাকতে হবে। \n" +
                    "\n" +
                    "দ্রষ্টব্য:  ভিডিও স্ট্রিমিং এর জন্য ড্যাটা চার্জ প্রযোজ্য হবে | \n" +
                    "\n" +
                    "গ্রাহক সেবা:\n" +
                    "কাস্টমার কেয়ার: 8801534524714 সকাল ৮ টা থেকে সন্ধ্যা ৭ টা পর্যন্ত)।\n" +
                    "● ইমেইল : support@vumobile.biz\n");
        } else if (operatorType.equals("4")) {
            txtFaq.setText("BDTUBE একটি ওয়াপ এবং App ভিত্তিক সেবা যার মাধ্যমে গ্রাহক বাংলা চলচ্চিত্র, স্বল্পদৈর্ঘ্য চলচ্চিত্র, মুভি ক্লিপ্স, মিউজিক, ফান ভিডিও, নাটক, টেলিফিল্ম, ভিডিও গানের স্ট্রিমিং দেখতে পারবেন। সাবস্ক্রিপশনের ভিত্তিতে এই সেবা পাওয়া যাবে। \n" +
                    "● সাবস্ক্রিপশনের ভিত্তিতে গ্রাহক দৈনিক সকল কনটেন্ট  ফ্রি দেখতে পারবেন। \n" +
                    "● সাবস্ক্রিপশন ফি হবে দৈনিক ২ টাকা (+ভ্যাট+এসডি+এসসি)। \n" +
                    "● BDTUBE এ নিবন্ধন করার পরে গ্রাহককে তার ড্যাটা সংযোগ সক্রিয় রাখতে হবে, যাতে তার কাঙ্খিত কনটেন্ট দেখতে পারেন। \n" +
                    "\n" +
                    "কিভাবে সেবাটি চালু করবেন: \n" +
                    "● APP : যে কোনো কনটেন্ট এ ক্লিক করুন, এবং নিবন্ধন বাটনটি ক্লিক করুন। \n" +
                    "\n" +
                    "কিভাবে সেবাটি বন্ধ করবেন: \n" +
                    "●এসএমএস: STOP লিখে 2128304 নম্বরে পাঠিয়ে দিন\n" +
                    " \n" +
                    "\n" +
                    "সংযোগের জন্যে কিছু নির্দেশনা দেওয়া হলো: \n" +
                    "●আপনার মোবাইলে রবি ইন্টারনেট (ওয়াপ/ইন্টারনেট) সেটআপ থাকতে হবে।\n" +
                    "●রবি প্রিপেইড/পোস্টপেইড সংযোগের ক্ষেত্রে আপনার এ্যাকাউন্টে যথেষ্ট পরিমাণ ক্রেডিট থাকতে হবে। \n" +
                    "দ্রষ্টব্য:  ভিডিও স্ট্রিমিং এর জন্য ড্যাটা চার্জ প্রযোজ্য হবে | \n" +
                    "\n" +
                    "গ্রাহক সেবা:\n" +
                    "কাস্টমার কেয়ার: 8801814426426 সকাল ৮ টা থেকে সন্ধ্যা ৭ টা পর্যন্ত)।\n" +
                    "●ইমেইল : support@vumobile.biz\n");
        } else {
            //txtFaq.setText(R.string.dialog_faq);
            txtFaq.setText("BDTUBE একটি ওয়াপ এবং App ভিত্তিক সেবা যার মাধ্যমে গ্রাহক বাংলা চলচ্চিত্র, স্বল্পদৈর্ঘ্য চলচ্চিত্র, মুভি ক্লিপ্স, মিউজিক, ফান ভিডিও, নাটক, টেলিফিল্ম, ভিডিও গানের স্ট্রিমিং দেখতে পারবেন। সাবস্ক্রিপশনের ভিত্তিতে এই সেবা পাওয়া যাবে। \n" +
                    "● সাবস্ক্রিপশনের ভিত্তিতে গ্রাহক দৈনিক সকল কনটেন্ট  ফ্রি দেখতে পারবেন। \n" +
                    "● সাবস্ক্রিপশন ফি হবে দৈনিক ২ টাকা (+ভ্যাট+এসডি+এসসি)। \n" +
                    "● BDTUBE এ নিবন্ধন করার পরে গ্রাহককে তার ড্যাটা সংযোগ সক্রিয় রাখতে হবে, যাতে তার কাঙ্খিত কনটেন্ট দেখতে পারেন। \n" +
                    "\n" +
                    "কিভাবে সেবাটি চালু করবেন: \n" +
                    "● APP : যে কোনো কনটেন্ট এ ক্লিক করুন, এবং নিবন্ধন বাটনটি ক্লিক করুন। \n" +
                    "\n" +
                    "কিভাবে সেবাটি বন্ধ করবেন: \n" +
                    "●এসএমএস: STOP লিখে 2128304 নম্বরে পাঠিয়ে দিন\n" +
                    " \n" +
                    "\n" +
                    "সংযোগের জন্যে কিছু নির্দেশনা দেওয়া হলো: \n" +
                    "●আপনার মোবাইলে রবি ইন্টারনেট (ওয়াপ/ইন্টারনেট) সেটআপ থাকতে হবে।\n" +
                    "●রবি প্রিপেইড/পোস্টপেইড সংযোগের ক্ষেত্রে আপনার এ্যাকাউন্টে যথেষ্ট পরিমাণ ক্রেডিট থাকতে হবে। \n" +
                    "দ্রষ্টব্য:  ভিডিও স্ট্রিমিং এর জন্য ড্যাটা চার্জ প্রযোজ্য হবে | \n" +
                    "\n" +
                    "গ্রাহক সেবা:\n" +
                    "কাস্টমার কেয়ার: 8801814426426 সকাল ৮ টা থেকে সন্ধ্যা ৭ টা পর্যন্ত)।\n" +
                    "●ইমেইল : support@vumobile.biz\n");
        }
    }
}
